#اساسيات المتغيرات
#المتغير عباره عن شيء يخزن في الذاكرة بشكل مؤقت و يستم استدعاءة عند وقت الحاجة
#كيف يتكون المتغير؟
# الشيء = شيء
#بشكل اوضح
#المتغير = شيء

var = "am var"

print (var)
print ("----------------------------------------------------------------------")

#في عمليه الطباعه سيتم قرائة var و استعداء قيمته للطباعه

# ويكننا انشاء سلهلة طباعه عن طريق المتغيرات و امور اكثر

name = "ali"
father_name = "hseeun"
old = 12
Address = "BD183769"

#طباعه السلسله
print ("he name is" ,name , father_name)

#طباعة متغيرات طبيعيه
print ("he old is :" ,old)
print ("he Address is :", Address)
