#while loop
#اذا كان الشرط صحيح سوف تستمر و اذا كان خطأ سوف تتوقف
#رقم 1 صحيح
#رقم 0 خطأ
# 1 > 0 صح
#0 > 1 خطأ
# 1 >= 0 صح
#0 >= 1 خطأ
# 10 >= 0 صح
#وهكذا
#ايضا لو كتبنا 
# x = ""
#مادام لم نكتب شيء ف يعتبر 0 ولو كتبنا شيء يعني 1 اي خطأ و صح

#تجربه ولكن خطيره سوف تستمر الى ملا نهاية

#يمكنك عكس العمليه لصبح شرط خطأ
#while 1 < 0 :

while 1 > 0 :
    print (True)

#و يمديك تسوي امثله اكثر مثل 
# x = ""
# while x :
#    print ("test")
#لن يعمل البرنامج بسبب ان x = 0 يعني خطأ

